/**
 * Created by Administrator on 2016/11/22 0022.
 */
var data = [];
var dataStr ='1、久保与二弦琴<br>\
<br>\
导演: 特拉维斯·奈特<br>\
编剧: 马克·海姆斯 / 克里斯·巴特勒<br>\
主演: 查理兹·塞隆 / 阿特·帕金森 / 拉尔夫·费因斯 / 鲁妮·玛拉 / 竹井乔治 / 更多<br>\
类型: 动画 / 奇幻 / 冒险<br>\
制片国家/地区: 美国<br>\
语言: 英语<br>\
上映日期: 2017(中国大陆) / 2016-08-19(美国)<br>\
片长: 101分钟<br>\
<br>\
<br>\
2、二重生活<br>\
<br>\
导演: 岸善幸<br>\
编剧: 岸善幸<br>\
主演: 门胁麦 / 长谷川博己 / 菅田将晖 / 中川雅也 / 乌丸节子 / 更多...<br>\
类型: 剧情<br>\
制片国家/地区: 日本<br>\
语言: 日语<br>\
上映日期: 2016-06-13(上海国际电影节) / 2016-06-25(日本)<br>\
片长: 126分钟<br>\
<br>\
<br>\
3、佩小姐的奇幻城堡<br>\
<br>\
导演: 蒂姆·波顿<br>\
编剧: 简·古德曼 / 兰森·里格斯<br>\
主演: 阿萨·巴特菲尔德 / 伊娃·格林 / 塞缪尔·杰克逊 / 朱迪·丹奇 / 艾拉·珀内尔 / 更多...<br>\
类型: 剧情 / 奇幻 / 冒险<br>\
制片国家/地区: 美国<br>\
语言: 英语<br>\
上映日期: 2016-12-02(中国大陆) / 2016-09-30(美国)<br>\
片长: 127分钟 / 126分钟(中国大陆)<br>\
<br>\
<br>\
4、假如猫从世界上消失了<br>\
<br>\
导演: 永井聪<br>\
编剧: 川村元气 / 冈田惠和<br>\
主演: 佐藤健 / 宫崎葵 / 滨田岳 / 奥野瑛太 / 石井杏奈 / 更多...<br>\
类型: 剧情 / 奇幻<br>\
制片国家/地区: 日本<br>\
语言: 日语<br>\
上映日期: 2016-05-14(日本)<br>\
片长: 103分钟<br>\
<br>\
<br>\
5、红海龟<br>\
<br>\
导演: 迈克尔·度德威特<br>\
编剧: 迈克尔·度德威特 / 帕斯卡尔·费兰<br>\
类型: 爱情 / 动画 / 奇幻<br>\
制片国家/地区: 日本 / 法国 / 比利时<br>\
语言: 无对白<br>\
上映日期: 2016-05-18(戛纳电影节) / 2016-06-29(法国) / 2016-09-17(日本)<br>\
片长: 80分钟<br>\
<br>\
<br>\
6、彼得的龙<br>\
<br>\
导演: 大卫·洛维<br>\
编剧: 大卫·洛维 / 托比·豪布鲁克斯 / 马尔科姆·马默斯顿 / 塞腾·艾·米勒<br>\
主演: 卡尔·厄本 / 布莱丝·达拉斯·霍华德 / 罗伯特·雷德福 / 韦斯·本特利 / 乌娜·劳伦斯 / 更多...<br>\
类型: 儿童 / 奇幻 / 冒险<br>\
制片国家/地区: 美国<br>\
语言: 英语<br>\
上映日期: 2016-08-12(美国)<br>\
片长: 103分钟<br>\
<br>\
<br>\
7、你的名字<br>\
<br>\
导演: 新海诚<br>\
编剧: 新海诚<br>\
主演: 神木隆之介 / 上白石萌音 / 长泽雅美 / 市原悦子 / 成田凌 / 更多...<br>\
类型: 剧情 / 爱情 / 动画<br>\
制片国家/地区: 日本<br>\
语言: 日语<br>\
上映日期: 2016-12-02(中国大陆) / 2016-08-26(日本)<br>\
片长: 106分钟<br>\
<br>\
<br>\
8、圆梦巨人<br>\
<br>\
导演: 史蒂文·斯皮尔伯格<br>\
编剧: 梅丽莎·马西森 / 罗尔德·达尔<br>\
主演: 鲁比·巴恩希尔 / 马克·里朗斯 / 比尔·哈德尔 / 丽贝卡·豪尔 / 佩内洛普·威尔顿 / 更多...<br>\
类型: 奇幻 / 冒险<br>\
制片国家/地区: 美国 / 英国<br>\
语言: 英语<br>\
上映日期: 2016-10-14(中国大陆) / 2016-07-01(美国) / 2016-05-14(戛纳电影节)<br>\
片长: 117分钟<br>\
<br>\
<br>\
9、大鱼海棠<br>\
<br>\
导演: 梁旋 / 张春<br>\
编剧: 梁旋<br>\
主演: 季冠霖 / 苏尚卿 / 许魏洲 / 金士杰 / 杨婷 / 更多...<br>\
类型: 剧情 / 动画 / 奇幻<br>\
制片国家/地区: 中国大陆<br>\
语言: 汉语普通话<br>\
上映日期: 2016-07-08(中国大陆)<br>\
片长: 105分钟<br>\
<br>\
<br>\
10、釜山行<br>\
<br>\
导演: 延尚昊<br>\
编剧: 延尚昊<br>\
主演: 孔侑 / 郑有美 / 马东锡 / 金秀安 / 金义城 / 更多...<br>\
类型: 动作 / 惊悚 / 灾难<br>\
制片国家/地区: 韩国<br>\
语言: 韩语<br>\
上映日期: 2016-05-13(戛纳电影节) / 2016-07-20(韩国)<br>\
片长: 118分钟<br>\
<br>\
<br>\
11、爱宠大机密<br>\
<br>\
导演: 克里斯·雷纳德 / 亚罗·切尼<br>\
编剧: 辛科·保罗 / 肯·道里欧 / 布莱恩·林奇<br>\
主演: 路易·C·K / 艾瑞克·斯通斯崔特 / 凯文·哈特 / 艾丽·坎伯尔 / 史蒂夫·库根 / 更多...<br>\
类型: 喜剧 / 动画<br>\
制片国家/地区: 美国<br>\
语言: 英语<br>\
上映日期: 2016-08-02(中国大陆) / 2016-07-08(美国)<br>\
片长: 87分钟 / 86分钟(中国大陆)<br>\
<br>\
<br>\
12、海底总动员2：多莉去哪儿<br>\
<br>\
导演: 安德鲁·斯坦顿 / 安格斯·麦克莱恩<br>\
编剧: 安德鲁·斯坦顿 / 维多利亚·斯特劳斯 / 鲍勃·彼德森<br>\
主演: 艾伦·德杰尼勒斯 / 艾伯特·布鲁克斯 / 艾德·奥尼尔 / 凯特琳·奥尔森 / 海登·罗兰斯 / 更多...<br>\
类型: 喜剧 / 动画 / 家庭 / 冒险<br>\
制片国家/地区: 美国<br>\
语言: 英语<br>\
上映日期: 2016-06-17(中国大陆/美国)<br>\
片长: 97分钟<br>\
';

var d = dataStr.split('<br><br><br>');
for(var i=0;i< d.length;i++){
    var c = d[i].split('<br><br>');
    data.push({
        img:c[0].replace('、',' ')+'.jpg',
        caption:c[0].split('、')[1],
        desc:c[1]
    });
    //console.log(c[0].replace('、',' ')+'.jpg');
}
